app/controllers/projects_controller.rb

  def index
    if params[:status_search].present?
      @projects = Project.where('status = ?', params[:status_search])
    else
      @projects = Project.all
---
SELECT "projects".* FROM "projects" WHERE (status = 'Propuesta')
SELECT "projects".* FROM "projects"

  def create
    @project = Project.create(project_name: params[:project_name],
                              description: params[:description],
                              start_date: params[:start_date],
                              end_date: params[:end_date],
                              status: params[:status])
---
INSERT INTO "projects" ("project_name", "description", "start_date", "end_date", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)